goodfuture/msp430-common-vh12/src/modbus.c
#include <msp430xG46x.h>
#include "test.h"

#include <string.h>

//extern unsigned char xdata PO_SerialNum[6][16];	//污染物代码表 序号
//extern unsigned char xdata PO_Type[6];					//污染物种类 Gas(1) or Water(0)
INT16U PO_No=0;	//污染物个数累加器
INT8U POdata_Type=0;//污染物数据类型  Rtd Rtp等
INT16U POdata_Receive=0;	//污染物数据接收标志位 Rtd Rtp等
INT8U PO_Retime=0;  //超时重发次数计数器

INT8U Channel_Num[6]={0,0,0,0,0,0};
INT8U Mod_checkover=1;
//unsigned char xdata Mod_bag[512]="\0";
//INT8U Mod_bagR[300]="\0";
long WatchDogCNT=0;
INT8U Device_ID=0;

//extern unsigned char xdata Mod_Receive[10];
//extern unsigned char ftstring[18];
//extern unsigned char xdata Mod_method;
//extern bit Mod_symbol;
//extern bit Mod_ontime;

struct MOD
{
	INT8U PO_code[4];
	INT8U modbus_address[2];
};

const struct MOD MOD_Gas[]={
                              {"S01\0",{0x00,0x00}},{"S02\0",{0x00,0x64}},{"S03\0",{0x00,0xc8}},{"S04\0",{0x01,0x2c}},{"S05\0",{0x01,0x90}},
                              {"S06\0",{0x01,0xf4}},{"S07\0",{0x02,0x58}},{"S08\0",{0x02,0xbc}},{"B02\0",{0x03,0x20}},{"01\0",{0x03,0x84}},
                              {"02\0",{0x03,0xe8}},{"03\0",{0x04,0x4c}},{"04\0",{0x04,0xb0}},{"05\0",{0x05,0x14}},{"06\0",{0x05,0x78}},
                              {"07\0",{0x05,0xdc}},{"08\0",{0x06,0x40}},{"09\0",{0x06,0xa4}},{"10\0",{0x07,0x08}},{"11\0",{0x07,0x6c}},
                              {"12\0",{0x07,0xd0}},{"13\0",{0x08,0x34}},{"14\0",{0x08,0x98}},{"15\0",{0x08,0xfc}},{"16\0",{0x09,0x60}},
                              {"17\0",{0x09,0xc4}},{"18\0",{0x0a,0x28}},{"19\0",{0x0a,0x8c}},{"20\0",{0x0a,0xf0}},{"21\0",{0x0b,0x54}},
                              {"22\0",{0x0b,0xb8}},{"23\0",{0x0c,0x1c}},{"24\0",{0x0c,0x80}},{"25\0",{0x0c,0xe4}},{"26\0",{0x0d,0x48}},
                              {"27\0",{0x0d,0xac}},{"28\0",{0x0e,0x10}},{"29\0",{0x0e,0x74}},{"30\0",{0x0e,0xd8}},{"31\0",{0x0f,0x3c}},
                              {"32\0",{0x0f,0xa0}},{"33\0",{0x10,0x04}},{"34\0",{0x10,0x68}},{"35\0",{0x10,0xcc}},{"36\0",{0x11,0x30}},
                              {"37\0",{0x11,0x94}},{"99\0",{0x11,0xf8}},{"Pfk\0",{0x12,0x5c}}
        					
            				  };
const struct MOD MOD_Water[]={
                              {"B01\0",{0x00,0x00}},{"001\0",{0x00,0x64}},{"002\0",{0x00,0xC8}},{"003\0",{0x01,0x2C}},{"010\0",{0x01,0x90}},
                              {"011\0",{0x00,0x00}},{"015\0",{0x02,0x58}},{"020\0",{0x02,0xBC}},{"021\0",{0x03,0x20}},{"022\0",{0x03,0x84}},
                              {"023\0",{0x03,0xE8}},{"024\0",{0x04,0x4C}},{"025\0",{0x04,0xb0}},{"026\0",{0x05,0x14}},{"027\0",{0x05,0x78}},
                              {"028\0",{0x05,0xdc}},{"029\0",{0x06,0x40}},{"030\0",{0x06,0xa4}},{"031\0",{0x07,0x08}},{"032\0",{0x07,0x6c}},
                              {"033\0",{0x07,0xd0}},{"034\0",{0x08,0x34}},{"035\0",{0x08,0x98}},{"036\0",{0x08,0xfc}},{"037\0",{0x09,0x60}},
                              {"038\0",{0x09,0xc4}},{"039\0",{0x0a,0x28}},{"040\0",{0x0a,0x8c}},{"041\0",{0x0a,0xf0}},{"060\0",{0x0B,0x54}},
                              {"061\0",{0x0b,0xb8}},{"065\0",{0x0c,0x1c}},{"080\0",{0x0c,0x80}},{"101\0",{0x0C,0xE4}},{"Pfk\0",{0x0d,0x48}}
        					};

extern COMBAG CBAG;

float Modbustore;
//float Modbustore[6][16][4];

extern struct _LCD
{
  unsigned LCD_DOS:1;
  unsigned LCD_set:1;
  unsigned LCD_back:1;
  unsigned LCD_backdoor:1;
  unsigned LCD_Dot:1;
  unsigned LCD_EQU:1;
  unsigned LCD_LOG:1;
}LCDSymbol;
extern float MODBUS_EQU[6];
void Modbus_RCommand(const INT8U *Maddr,INT8U method,INT8U PoType,INT8U Device);


void Mod_Command(INT8U method)
{
	//unsigned char Mod_bag[8]={0x01,0x03,0,0,0x00,0x02};
	INT8U i;
	//INT16U j;
	//INT8U Flag_N[2]="N\0";
	switch(method)
	{
		case Mod_RealD:
			i=1;
		break;
		case Mod_MinD:
			i=13;	
		break;
		case Mod_DayD:
		case Mod_HourD:
			i=12;
		break;
		default:
		break;
	}
	if(PO_Retime>=2)		//重发次数超过三次
	{
		PO_Retime=0;
		POdata_Type++;
	}
	else
	{
		if((POdata_Receive&(0x01<<POdata_Type))!=0)//已经接收到数据
		{
			POdata_Type++;
			PO_Retime=0;
		}
	
	}
	if(POdata_Type>=i)
	{
		if(POdata_Receive!=0)
		{
			/*if(method==Mod_RealD)
			{
				j=strlen(Mod_bagR);
				strcat(Mod_bagR,Mod_PPR[POdata_Type]);
				if(SPARA.PO_Type[Device_ID]==2)
					insert(Mod_bagR,MOD_Gas[SPARA.PO_SerialNum[Device_ID][PO_No]].PO_code,j+2);
				else if(SPARA.PO_Type[Device_ID]==1)
					insert(Mod_bagR,MOD_Water[SPARA.PO_SerialNum[Device_ID][PO_No]].PO_code,j+2);
				strcat(Mod_bagR,Flag_N);
			}*/
			//Channel_Receive|=(0x01<<PO_No);
			//Symbol.Mod_complete=1;
		}
		PO_No++;
		POdata_Receive=0;
		POdata_Type=0;
		PO_Retime=0;
		return;
		
	}
	if(PO_No>=Channel_Num[Device_ID])
	{
		PO_No=0;
		Device_ID++;
		if(Device_ID>5)
		{
			Device_ID=0;
			if(Mod_method==Mod_RealD)
				Symbol.Mod_checkover=2;
			else
				Symbol.Mod_checkover=1;
			Symbol.Mod_ontime=0;
			Symbol.Hour_data=0;
			Symbol.Day_data=0;
		}
		/*if(Channel_Receive!=0)
		{
			//Mod_complete=1;
			Channel_Receive=0;
		}*/
		return;
	}
	//if((Device_Enable&(0x01<<(Device_ID)))!=0)
	switch(SPARA.PO_Type[Device_ID])
	{
		case 1://water
			Modbus_RCommand(MOD_Water[SPARA.PO_SerialNum[Device_ID][PO_No]].modbus_address,method,0,Device_ID);
		break;
		case 2://gas
			Modbus_RCommand(MOD_Gas[SPARA.PO_SerialNum[Device_ID][PO_No]].modbus_address,method,1,Device_ID);
		break;
		default:
		break;
	}
	//else
	//	Device_ID++;	
}

void Modbus_RCommand(const INT8U *Maddr,INT8U method,INT8U PoType,INT8U Device)
{
	INT8U mod_bag[9];//={0x01,0x03};
	volatile INT8U Mod_send=0;
	union
	{
		char add1[2];
		int add2;
	}add3;
  INT8U CRC16[2];
	add3.add1[0]=*(Maddr+1);
	add3.add1[1]=*Maddr;
	add3.add2+=2*POdata_Type;
	mod_bag[0]=Device+1;
	mod_bag[1]=0x03;
	mod_bag[2]=add3.add1[1];
	mod_bag[3]=add3.add1[0];
	mod_bag[4]=0x00;
	mod_bag[5]=0x02;
	if(PoType)
	{
		Mod_send=1;
			
	}
	else
	switch(method)
	{
		case Mod_RealD:
			{
				if((POdata_Type==2)||(POdata_Type==3))
				{
					Mod_send=0;
					POdata_Type++;
					PO_Retime=0;
				}
				else
					Mod_send=1;
			}
		break;
		/*case Mod_MinD:
			{
				if(((POdata_Type>2)&&(POdata_Type<7))||(POdata_Type>9))
				{
					POdata_Type++;
					Mod_send=0;
					PO_Retime=0;
				}
				else
					Mod_send=1;
			}
			
		break;*/
		case Mod_DayD:
		case Mod_HourD:
			{
				if(POdata_Type>5)
				{
					Mod_send=0;
					POdata_Type++;
					PO_Retime=0;
				}
				else
					Mod_send=1;	
			}
		break;
		default:
		break;
	}
	if(Mod_send)
	{
		CRC_Calculation_B(mod_bag,6,CRC16);
		mod_bag[6]=CRC16[0];		//CRC高
		mod_bag[7]=CRC16[1];		//CRC低
		Mod_send=0;
    /*禁止中断*/
    _BIC_SR(GIE);
		if(mod_bag[0]<=0x04)
			SendData(mod_bag,8,COM5); //485
		else if(mod_bag[0]==0x05)
			SendData(mod_bag,8,COM2); //232
		else
			SendData(mod_bag,8,COM3); //232
		PO_Retime++;
    /*开中断*/
    _BIS_SR(GIE);
	}
}

void Mod_dealdata(INT8U *receive)
{
  union
  {
          char a[4];
          float b;
  }Mod_D;
  //INT16U i;
  //INT8U NP=0;
  //INT8U Negtive[2]="-\0";
  //INT8U ftstring[18];
  INT8U CRC16[2];
  //unsigned char xdata Flag_N[2]="N\0";
  CRC_Calculation_B(receive,7,CRC16);
  if((CRC16[0]==*(receive+7))&&(CRC16[1]==*(receive+8))&&(*(receive+1)==0x03))	//高低位判别？
  {
    Mod_D.a[0]=*(receive+4);//Mod_Receive[5];
    Mod_D.a[1]=*(receive+3);//Mod_Receive[6];
    Mod_D.a[2]=*(receive+6);//Mod_Receive[3];
    Mod_D.a[3]=*(receive+5);//Mod_Receive[4];

