goodfuture/msp430-common-vh12/src/modbus.c
    MODBUS_EQU[Device_ID]=Mod_D.b;
    if(LCD_page==44)
    {
      LCDSymbol.LCD_EQU=1;
      Symbol.LCD_deal=1;
    }
    Modbustore =Mod_D.b;


  }
  else if((CRC16[0]==*(receive+7))&&(CRC16[1]==*(receive+8))&&(*(receive+1)==0x10))
  {
    POdata_Receive  =0;
    Symbol.Mod_checkover=1;
  }
  else
  {
    POdata_Receive&=(~(0x01<<POdata_Type));
  }
  //Symbol.Mod_symbol=0;
}
/*
void tempfunction()
{
  union
  {
          char a[4];
          float b;
  }Mod_D;
  INT16U i;
  INT8U NP=0;
  INT8U Negtive[2]="-\0";
  INT8U ftstring[18];
  INT8U CRC16[2];
  if((Mod_D.a[3]&0x80)==0x80)
    {
      Mod_D.a[3]&=0x7f;
      NP=1;
    }

    float_to_string(Mod_D.b,ftstring);
    if(NP)
    {
      insert(ftstring,Negtive,1);
    }
    switch(Mod_method)
    {
      case Mod_RealD:
        i=strlen(Mod_bagR);
        strcat(Mod_bagR,Mod_PPR[POdata_Type]);
        if(SPARA.PO_Type[Device_ID]==2)
                insert(Mod_bagR,MOD_Gas[SPARA.PO_SerialNum[Device_ID][PO_No]].PO_code,i+2);
        else if(SPARA.PO_Type[Device_ID]==1)
                insert(Mod_bagR,MOD_Water[SPARA.PO_SerialNum[Device_ID][PO_No]].PO_code,i+2);
        //if(POdata_Type==4)
        //	strcat(Mod_bagR,Flag_N);
        //else
                strcat(Mod_bagR,ftstring);
      break;
      case Mod_MinD:
      case Mod_DayD:
      case Mod_HourD:
        if((PO_No<(Channel_Num[Device_ID]-1))&&(POdata_Type==0))
        {
                strcat(Mod_bagR,semicolon);
        }
        else
                strcat(Mod_bagR,comma);
        if(SPARA.PO_Type[Device_ID]==2)
                strcat(Mod_bagR,MOD_Gas[SPARA.PO_SerialNum[Device_ID][PO_No]].PO_code);
        else if(SPARA.PO_Type[Device_ID]==1)
                strcat(Mod_bagR,MOD_Water[SPARA.PO_SerialNum[Device_ID][PO_No]].PO_code);
        //if(Mod_method==Mod_MinD)	
        //	strcat(CBAG.cbag_dynamic,Mod_PPM[POdata_Type]);
        //else
                strcat(Mod_bagR,Mod_PP[POdata_Type]);
        strcat(Mod_bagR,ftstring);
      break;
      default:
      break;
    }

}
*/

#if 0
void ModataUpload(INT8U ModM)
{
  INT8U i,j,k;
  INT8U lm_j,lm_k; //limit
  INT16U lent;
  union
  {
          char a[4];
          float b;
  }Mod_D;
  //INT8U cps[]="DataTime=\0";
  INT8U Flag_N[2]="N\0";
  INT8U NP=0;
  INT8U Negtive[2]="-\0";
  INT8U ftstring[18];

    switch(ModM)
    {
      case Mod_RealD:
        //Symbol.ccc=1;
        //Response(4);
        //Symbol.ccc=0;
        //strcat(CBAG.cbag_dynamic,cps);
        //strcat(CBAG.cbag_dynamic,System_Time);
        for(i=0;i<6;i++)
        {
          lm_j  =Channel_Num[i];
          for(j=0;j<lm_j;j++)
          {
            switch(SPARA.PO_Type[i])
            {
              case 1: //water
                lm_k  =1;
              break;
              case 2: //gas
                lm_k  =4;
              break;
              default:
                lm_k  =0;
              break;
            }
            for(k=0;k<lm_k;k++)
            {
              Mod_D.b =Modbustore[i][j][k];
              if((Mod_D.a[3]&0x80)==0x80)
              {
                Mod_D.a[3]&=0x7f;
                NP=1;
              }

              float_to_string(Mod_D.b,ftstring);
              if(NP)
              {
                insert(ftstring,Negtive,1);
              }
              lent  =strlen(CBAG.cbag_dynamic);
              strcat(CBAG.cbag_dynamic,Mod_PPR[k]);
              if(SPARA.PO_Type[i]==2)
                insert(CBAG.cbag_dynamic,MOD_Gas[SPARA.PO_SerialNum[i][j]].PO_code,lent+2);
              else if(SPARA.PO_Type[i]==1)
                insert(CBAG.cbag_dynamic,MOD_Water[SPARA.PO_SerialNum[i][j]].PO_code,lent+2);
              strcat(CBAG.cbag_dynamic,ftstring);
              MemoryClear(ftstring,sizeof(ftstring));
              //strcat(CBAG.cbag_dynamic,Mod_bagR);
            }
            if(lm_k!=0)
            {
              lent  =strlen(CBAG.cbag_dynamic);
              strcat(CBAG.cbag_dynamic,Mod_PPR[4]);
              if(SPARA.PO_Type[i]==2)
                      insert(CBAG.cbag_dynamic,MOD_Gas[SPARA.PO_SerialNum[i][j]].PO_code,lent+2);
              else if(SPARA.PO_Type[i]==1)
                      insert(CBAG.cbag_dynamic,MOD_Water[SPARA.PO_SerialNum[i][j]].PO_code,lent+2);
              strcat(CBAG.cbag_dynamic,Flag_N);
            }
          }
          /*if(lm_j!=0)
            Add_Send();
          else
            MemoryClear(CBAG.cbag_dynamic,sizeof(CBAG.cbag_dynamic));
          */
        }
      break;
      case Mod_MinD:
      break;
      case Mod_HourD:
        for(i=0;i<6;i++)
        {
          lm_j  =Channel_Num[i];
          for(j=0;j<lm_j;j++)
          {
            switch(SPARA.PO_Type[i])
            {
              case 1: //water
                lm_k  =2;
              break;
              case 2: //gas
                lm_k  =4;
              break;
              default:
                lm_k  =0;
              break;
            }
            //for(k=0;k<lm_k;k++)
            if(lm_k!=0)
            {
              if(dev_mma_H[k].num==0)
                Mod_D.b =0;
              else
                Mod_D.b =dev_mma_H[k].min;
              if((Mod_D.a[3]&0x80)==0x80)
              {
                Mod_D.a[3]&=0x7f;
                NP=1;
              }

              float_to_string(Mod_D.b,ftstring);
              if(NP)
              {
                insert(ftstring,Negtive,1);
              }
              lent  =strlen(CBAG.cbag_dynamic);
              strcat(CBAG.cbag_dynamic,Mod_Phase7); //min
              if(SPARA.PO_Type[i]==2)
                insert(CBAG.cbag_dynamic,MOD_Gas[SPARA.PO_SerialNum[i][j]].PO_code,lent+2);
              else if(SPARA.PO_Type[i]==1)
                insert(CBAG.cbag_dynamic,MOD_Water[SPARA.PO_SerialNum[i][j]].PO_code,lent+2);
              strcat(CBAG.cbag_dynamic,ftstring);
              MemoryClear(ftstring,sizeof(ftstring));

              if(dev_mma_H[k].num==0)
                dev_mma_H[k].avg =0;
              else
                dev_mma_H[k].avg  =dev_mma_H[k].sum/dev_mma_H[k].num;
              Mod_D.b =dev_mma_H[k].avg;
              if((Mod_D.a[3]&0x80)==0x80)
              {
                Mod_D.a[3]&=0x7f;
                NP=1;
              }

              float_to_string(Mod_D.b,ftstring);
              if(NP)
              {
                insert(ftstring,Negtive,1);
              }
              lent  =strlen(CBAG.cbag_dynamic);
              strcat(CBAG.cbag_dynamic,Mod_Phase8);
              if(SPARA.PO_Type[i]==2)
                insert(CBAG.cbag_dynamic,MOD_Gas[SPARA.PO_SerialNum[i][j]].PO_code,lent+2);
              else if(SPARA.PO_Type[i]==1)
                insert(CBAG.cbag_dynamic,MOD_Water[SPARA.PO_SerialNum[i][j]].PO_code,lent+2);
              strcat(CBAG.cbag_dynamic,ftstring);
              MemoryClear(ftstring,sizeof(ftstring));

              if(dev_mma_H[k].num==0)
                Mod_D.b =0;
              else
                Mod_D.b =dev_mma_H[k].max;
              if((Mod_D.a[3]&0x80)==0x80)
              {
                Mod_D.a[3]&=0x7f;
                NP=1;
              }

              float_to_string(Mod_D.b,ftstring);
              if(NP)
              {
                insert(ftstring,Negtive,1);
              }
              lent  =strlen(CBAG.cbag_dynamic);
              strcat(CBAG.cbag_dynamic,Mod_Phase6);
              if(SPARA.PO_Type[i]==2)
                insert(CBAG.cbag_dynamic,MOD_Gas[SPARA.PO_SerialNum[i][j]].PO_code,lent+2);
              else if(SPARA.PO_Type[i]==1)
                insert(CBAG.cbag_dynamic,MOD_Water[SPARA.PO_SerialNum[i][j]].PO_code,lent+2);
              strcat(CBAG.cbag_dynamic,ftstring);
              MemoryClear(ftstring,sizeof(ftstring));

              if(SPARA.PO_Type[i]==2)
              {
                if((SPARA.PO_SerialNum[i][j]==8)||(SPARA.PO_SerialNum[i][j]==9)||(SPARA.PO_SerialNum[i][j]==10)||(SPARA.PO_SerialNum[i][j]==11))
                {
                  if(dev_mma_H[k].num==0)
                    Mod_D.b =0;
                  else
                    Mod_D.b =dev_mma_H[k].sum;
                  if((Mod_D.a[3]&0x80)==0x80)
                  {
                    Mod_D.a[3]&=0x7f;
                    NP=1;
                  }

                  float_to_string(Mod_D.b,ftstring);
                  if(NP)
                  {
                    insert(ftstring,Negtive,1);
                  }
                  lent  =strlen(CBAG.cbag_dynamic);
                  strcat(CBAG.cbag_dynamic,Mod_Phase18);

