goodfuture/msp430-common-vh12/src/modbus.c
                    insert(CBAG.cbag_dynamic,MOD_Gas[SPARA.PO_SerialNum[i][j]].PO_code,lent+2);

                  strcat(CBAG.cbag_dynamic,ftstring);
                  MemoryClear(ftstring,sizeof(ftstring));
                }
              }
              //strcat(CBAG.cbag_dynamic,Mod_bagR);

              //if(lm_k!=0)
              /*{
                lent  =strlen(CBAG.cbag_dynamic);
                strcat(CBAG.cbag_dynamic,Mod_PPR[4]);
                if(SPARA.PO_Type[i]==2)
                        insert(CBAG.cbag_dynamic,MOD_Gas[SPARA.PO_SerialNum[i][j]].PO_code,lent+2);
                else if(SPARA.PO_Type[i]==1)
                        insert(CBAG.cbag_dynamic,MOD_Water[SPARA.PO_SerialNum[i][j]].PO_code,lent+2);
                strcat(CBAG.cbag_dynamic,Flag_N);
              }*/
            }
          }
        }
        //MemoryClear(dev_mma_H,sizeof(dev_mma_H));
      break;
      case Mod_DayD:
        for(i=0;i<6;i++)
        {
          lm_j  =Channel_Num[i];
          for(j=0;j<lm_j;j++)
          {
            switch(SPARA.PO_Type[i])
            {
              case 1: //water
                lm_k  =2;
              break;
              case 2: //gas
                lm_k  =4;
              break;
              default:
                lm_k  =0;
              break;
            }
            //for(k=0;k<lm_k;k++)
            if(lm_k!=0)
            {
              if(dev_mma_D[k].num==0)
                Mod_D.b =0;
              else
                Mod_D.b =dev_mma_D[k].min;
              if((Mod_D.a[3]&0x80)==0x80)
              {
                Mod_D.a[3]&=0x7f;
                NP=1;
              }

              float_to_string(Mod_D.b,ftstring);
              if(NP)
              {
                insert(ftstring,Negtive,1);
              }
              lent  =strlen(CBAG.cbag_dynamic);
              strcat(CBAG.cbag_dynamic,Mod_Phase7); //min
              if(SPARA.PO_Type[i]==2)
                insert(CBAG.cbag_dynamic,MOD_Gas[SPARA.PO_SerialNum[i][j]].PO_code,lent+2);
              else if(SPARA.PO_Type[i]==1)
                insert(CBAG.cbag_dynamic,MOD_Water[SPARA.PO_SerialNum[i][j]].PO_code,lent+2);
              strcat(CBAG.cbag_dynamic,ftstring);
              MemoryClear(ftstring,sizeof(ftstring));

              if(dev_mma_D[k].num==0)
                dev_mma_D[k].avg =0;
              else
                dev_mma_D[k].avg  =dev_mma_D[k].sum/dev_mma_D[k].num;
              Mod_D.b =dev_mma_H[k].avg;
              if((Mod_D.a[3]&0x80)==0x80)
              {
                Mod_D.a[3]&=0x7f;
                NP=1;
              }

              float_to_string(Mod_D.b,ftstring);
              if(NP)
              {
                insert(ftstring,Negtive,1);
              }
              lent  =strlen(CBAG.cbag_dynamic);
              strcat(CBAG.cbag_dynamic,Mod_Phase8);
              if(SPARA.PO_Type[i]==2)
                insert(CBAG.cbag_dynamic,MOD_Gas[SPARA.PO_SerialNum[i][j]].PO_code,lent+2);
              else if(SPARA.PO_Type[i]==1)
                insert(CBAG.cbag_dynamic,MOD_Water[SPARA.PO_SerialNum[i][j]].PO_code,lent+2);
              strcat(CBAG.cbag_dynamic,ftstring);
              MemoryClear(ftstring,sizeof(ftstring));

              if(dev_mma_D[k].num==0)
                Mod_D.b =0;
              else
                Mod_D.b =dev_mma_D[k].max;
              if((Mod_D.a[3]&0x80)==0x80)
              {
                Mod_D.a[3]&=0x7f;
                NP=1;
              }

              float_to_string(Mod_D.b,ftstring);
              if(NP)
              {
                insert(ftstring,Negtive,1);
              }
              lent  =strlen(CBAG.cbag_dynamic);
              strcat(CBAG.cbag_dynamic,Mod_Phase6);
              if(SPARA.PO_Type[i]==2)
                insert(CBAG.cbag_dynamic,MOD_Gas[SPARA.PO_SerialNum[i][j]].PO_code,lent+2);
              else if(SPARA.PO_Type[i]==1)
                insert(CBAG.cbag_dynamic,MOD_Water[SPARA.PO_SerialNum[i][j]].PO_code,lent+2);
              strcat(CBAG.cbag_dynamic,ftstring);
              MemoryClear(ftstring,sizeof(ftstring));
              if(SPARA.PO_Type[i]==2)
              {
                if((SPARA.PO_SerialNum[i][j]==8)||(SPARA.PO_SerialNum[i][j]==9)||(SPARA.PO_SerialNum[i][j]==10)||(SPARA.PO_SerialNum[i][j]==11))
                {
                  if(dev_mma_D[k].num==0)
                    Mod_D.b =0;
                  else
                    Mod_D.b =dev_mma_D[k].sum;
                  if((Mod_D.a[3]&0x80)==0x80)
                  {
                    Mod_D.a[3]&=0x7f;
                    NP=1;
                  }

                  float_to_string(Mod_D.b,ftstring);
                  if(NP)
                  {
                    insert(ftstring,Negtive,1);
                  }
                  lent  =strlen(CBAG.cbag_dynamic);
                  strcat(CBAG.cbag_dynamic,Mod_Phase18);

                    insert(CBAG.cbag_dynamic,MOD_Gas[SPARA.PO_SerialNum[i][j]].PO_code,lent+2);

                  strcat(CBAG.cbag_dynamic,ftstring);
                  MemoryClear(ftstring,sizeof(ftstring));
                }
              }

              //strcat(CBAG.cbag_dynamic,Mod_bagR);

              //if(lm_k!=0)
              /*{
                lent  =strlen(CBAG.cbag_dynamic);
                strcat(CBAG.cbag_dynamic,Mod_PPR[4]);
                if(SPARA.PO_Type[i]==2)
                        insert(CBAG.cbag_dynamic,MOD_Gas[SPARA.PO_SerialNum[i][j]].PO_code,lent+2);
                else if(SPARA.PO_Type[i]==1)
                        insert(CBAG.cbag_dynamic,MOD_Water[SPARA.PO_SerialNum[i][j]].PO_code,lent+2);
                strcat(CBAG.cbag_dynamic,Flag_N);
              }*/
            }
          }
        }
        MemoryClear(dev_mma_D,sizeof(dev_mma_D));
      break;
      default:
      break;
    }
}
#else
void ModataUpload(INT8U ModM)
{
  union
  {
          char a[4];
          float b;
  }Mod_D;
  //INT8U cps[]="DataTime=\0";
  //INT8U Flag_N[2]="N\0";
  INT8U NP=0;
  INT8U Negtive[2]="-\0";
  INT8U rtdstr[11]=";011-Rtd=\0";
  INT8U flagstr[13]=",011-Flag=N\0";
  INT8U minstr[11]=";011-Min=\0";
  INT8U avgstr[11]=",011-Avg=\0";
  INT8U maxstr[11]=",011-Max=\0";
  INT8U ftstring[18];
  INT16U i;
  float totaltmp=0,total_b01_tmp=0;
  
  
