goodfuture/msp430-common-vh12/src/modbus.c
  if(ModM==Mod_RealD)
  {
    Mod_D.b =Modbustore;
    if((Mod_D.a[3]&0x80)==0x80)
    {
      Mod_D.a[3]&=0x7f;
      NP=1;
    }

    float_to_string(Mod_D.b,ftstring);
    if(NP)
    {
      insert(ftstring,Negtive,1);
    }
    strcat(CBAG.cbag_dynamic,rtdstr);
    strcat(CBAG.cbag_dynamic,ftstring);
    MemoryClear(ftstring,sizeof(ftstring));      
    strcat(CBAG.cbag_dynamic,flagstr);
  }
  else
  {
    MAX_MIN *maxminp;
    switch(ModM)
    {
      case Mod_MinD: 
        maxminp =dev_mma_M;
        if(maxminp->num==0)
          Mod_D.b =0;
        else
          Mod_D.b =maxminp->min;
        if((Mod_D.a[3]&0x80)==0x80)
        {
          Mod_D.a[3]&=0x7f;
          NP=1;
        }
  
        float_to_string(Mod_D.b,ftstring);
        if(NP)
        {
          insert(ftstring,Negtive,1);
        }
        //lent  =strlen(CBAG.cbag_dynamic);
        strcat(CBAG.cbag_dynamic,minstr); //min
        strcat(CBAG.cbag_dynamic,ftstring);
        MemoryClear(ftstring,sizeof(ftstring));
  
        if(maxminp->num==0)
          maxminp->avg =0;
        else
          maxminp->avg  =maxminp->sum/maxminp->num;
        //Mod_D.b =maxminp->avg; 
        Mod_D.b =maxminp->max; //小时cod的平均值就等于它的测量值（环保局091026）
        if((Mod_D.a[3]&0x80)==0x80)
        {
          Mod_D.a[3]&=0x7f;
          NP=1;
        }
        float_to_string(Mod_D.b,ftstring);
        if(NP)
        {
          insert(ftstring,Negtive,1);
        }
        strcat(CBAG.cbag_dynamic,avgstr);
        strcat(CBAG.cbag_dynamic,ftstring);
        MemoryClear(ftstring,sizeof(ftstring));
        
        if(maxminp->num==0)
          Mod_D.b =0;
        else
          Mod_D.b =maxminp->max;
        if((Mod_D.a[3]&0x80)==0x80)
        {
          Mod_D.a[3]&=0x7f;
          NP=1;
        }
        float_to_string(Mod_D.b,ftstring);
        if(NP)
        {
          insert(ftstring,Negtive,1);
        }        
        strcat(CBAG.cbag_dynamic,maxstr);
        strcat(CBAG.cbag_dynamic,ftstring);
        MemoryClear(ftstring,sizeof(ftstring));
        
        //Hour_COD_avg[current_hour]=maxminp->max;
      break;
      case Mod_HourD: 
        maxminp =dev_mma_H;
        if(maxminp->num==0)
          Mod_D.b =0;
        else
          Mod_D.b =maxminp->min;
        if((Mod_D.a[3]&0x80)==0x80)
        {
          Mod_D.a[3]&=0x7f;
          NP=1;
        }
  
        float_to_string(Mod_D.b,ftstring);
        if(NP)
        {
          insert(ftstring,Negtive,1);
        }
        //lent  =strlen(CBAG.cbag_dynamic);
        strcat(CBAG.cbag_dynamic,minstr); //min
        strcat(CBAG.cbag_dynamic,ftstring);
        MemoryClear(ftstring,sizeof(ftstring));
  
        if(maxminp->num==0)
          maxminp->avg =0;
        else
          maxminp->avg  =maxminp->sum/maxminp->num;
        //Mod_D.b =maxminp->avg; 
        Mod_D.b =maxminp->max; //小时cod的平均值就等于它的测量值（环保局091026）
        if((Mod_D.a[3]&0x80)==0x80)
        {
          Mod_D.a[3]&=0x7f;
          NP=1;
        }
        float_to_string(Mod_D.b,ftstring);
        if(NP)
        {
          insert(ftstring,Negtive,1);
        }
        strcat(CBAG.cbag_dynamic,avgstr);
        strcat(CBAG.cbag_dynamic,ftstring);
        MemoryClear(ftstring,sizeof(ftstring));
        
        if(maxminp->num==0)
          Mod_D.b =0;
        else
          Mod_D.b =maxminp->max;
        if((Mod_D.a[3]&0x80)==0x80)
        {
          Mod_D.a[3]&=0x7f;
          NP=1;
        }
        float_to_string(Mod_D.b,ftstring);
        if(NP)
        {
          insert(ftstring,Negtive,1);
        }        
        strcat(CBAG.cbag_dynamic,maxstr);
        strcat(CBAG.cbag_dynamic,ftstring);
        MemoryClear(ftstring,sizeof(ftstring));
        
        Hour_COD_avg[current_hour]=maxminp->max;
      break;
      case Mod_DayD:
        maxminp =dev_mma_D;
        if(maxminp->num==0)
          Mod_D.b =0;
        else
          Mod_D.b =maxminp->min;
        if((Mod_D.a[3]&0x80)==0x80)
        {
          Mod_D.a[3]&=0x7f;
          NP=1;
        }
  
        float_to_string(Mod_D.b,ftstring);
        if(NP)
        {
          insert(ftstring,Negtive,1);
        }
        //lent  =strlen(CBAG.cbag_dynamic);
        strcat(CBAG.cbag_dynamic,minstr); //min
        strcat(CBAG.cbag_dynamic,ftstring);
        MemoryClear(ftstring,sizeof(ftstring));
  
        for(i=0;i<24;i++)
        {
          totaltmp += Hour_B01_avg[i]*Hour_COD_avg[i];
          total_b01_tmp +=Hour_B01_avg[i];
        }
        if(total_b01_tmp!=0.0)
        {
          maxminp->avg=totaltmp/total_b01_tmp;
        }
        else
        {
          maxminp->avg=0;
        }
        Mod_D.b =maxminp->avg;
        if((Mod_D.a[3]&0x80)==0x80)
        {
          Mod_D.a[3]&=0x7f;
          NP=1;
        }
        float_to_string(Mod_D.b,ftstring);
        if(NP)
        {
          insert(ftstring,Negtive,1);
        }
        strcat(CBAG.cbag_dynamic,avgstr);
        strcat(CBAG.cbag_dynamic,ftstring);
        MemoryClear(ftstring,sizeof(ftstring));
        
        if(maxminp->num==0)
          Mod_D.b =0;
        else
          Mod_D.b =maxminp->max;
        if((Mod_D.a[3]&0x80)==0x80)
        {
          Mod_D.a[3]&=0x7f;
          NP=1;
        }
        float_to_string(Mod_D.b,ftstring);
        if(NP)
        {
          insert(ftstring,Negtive,1);
        }        
        strcat(CBAG.cbag_dynamic,maxstr);
        strcat(CBAG.cbag_dynamic,ftstring);
        MemoryClear(ftstring,sizeof(ftstring));
        
        MemoryClear(Hour_COD_avg,sizeof(Hour_COD_avg));
        MemoryClear(Hour_B01_avg,sizeof(Hour_B01_avg));
      break;
      default:
        maxminp =0;
      break;
    }
  }
}
#endif

#if 0
void DevCalculation(void)
{
  INT16U i,j;
  for(i=0;i<6;i++)
  {
    if(Channel_Num[i]!=0)
    {
      for(j=0;j<Channel_Num[i];j++)
      {
        if(dev_mma_H[j].num==0)
        {
          dev_mma_H[j].max  =dev_mma_H[j].min =dev_mma_H[j].sum =Modbustore[i][j][0];
          dev_mma_H[j].num++;
        }
        else
        {
          if(Modbustore[i][j][0]<dev_mma_H[j].min)
            dev_mma_H[j].min  =Modbustore[i][j][0];
          if(Modbustore[i][j][0]>dev_mma_H[j].max)
            dev_mma_H[j].max  =Modbustore[i][j][0];
          dev_mma_H[j].sum  +=Modbustore[i][j][0];
          dev_mma_H[j].num++;
        }
        if(dev_mma_D[j].num==0)
        {
          dev_mma_D[j].max  =dev_mma_D[j].min =dev_mma_D[j].sum =Modbustore[i][j][0];
          dev_mma_D[j].num++;
        }
        else
        {
          if(Modbustore[i][j][0]<dev_mma_D[j].min)
            dev_mma_D[j].min  =Modbustore[i][j][0];
          if(Modbustore[i][j][0]>dev_mma_D[j].max)
            dev_mma_D[j].max  =Modbustore[i][j][0];
          dev_mma_D[j].sum  +=Modbustore[i][j][0];
          dev_mma_D[j].num++;
        }
      }
      break;
    }
  }
}

#else
void DevCalculation(void)
{
  if(dev_mma_M[0].num==0)
  {
    dev_mma_M[0].max  =dev_mma_M[0].min =dev_mma_M[0].sum =Modbustore;
    dev_mma_M[0].num++;
  }
  else
  {
    if(Modbustore<dev_mma_M[0].min)
      dev_mma_M[0].min  =Modbustore;
    if(Modbustore>dev_mma_M[0].max)
      dev_mma_M[0].max  =Modbustore;
    dev_mma_M[0].sum  +=Modbustore;
    dev_mma_M[0].num++;
  }
  
