goodfuture/msp430-common-vh12/src/modbus.c
  if(dev_mma_H[0].num==0)
  {
    dev_mma_H[0].max  =dev_mma_H[0].min =dev_mma_H[0].sum =Modbustore;
    dev_mma_H[0].num++;
  }
  else
  {
    if(Modbustore<dev_mma_H[0].min)
      dev_mma_H[0].min  =Modbustore;
    if(Modbustore>dev_mma_H[0].max)
      dev_mma_H[0].max  =Modbustore;
    dev_mma_H[0].sum  +=Modbustore;
    dev_mma_H[0].num++;
  }
  if(dev_mma_D[0].num==0)
  {
    dev_mma_D[0].max  =dev_mma_D[0].min =dev_mma_D[0].sum =Modbustore;
    dev_mma_D[0].num++;
  }
  else
  {
    if(Modbustore<dev_mma_D[0].min)
      dev_mma_D[0].min  =Modbustore;
    if(Modbustore>dev_mma_D[0].max)
      dev_mma_D[0].max  =Modbustore;
    dev_mma_D[0].sum  +=Modbustore;
    dev_mma_D[0].num++;
  }
}
#endif

void dev_calibrate_sample(INT8U type)
{
  INT8U caltemp[12];
  INT16U devidtmp=0,devchtmp=0;
  INT8U CRC16[2];
  union
  {
          char add1[2];
          int add2;
  }add3;

  for(devidtmp=0;devidtmp<6;devidtmp++)
  {
    for(devchtmp=0;devchtmp<16;devchtmp++)
    {
      if(SPARA.PO_Type[devidtmp]==2)
      {
        if(strcmp(devcpoID,MOD_Gas[SPARA.PO_SerialNum[devidtmp][devchtmp]].PO_code)==0)
        {
          caltemp[0]  =devidtmp+1;
          caltemp[1]  =0x10;
          add3.add1[0]=MOD_Gas[SPARA.PO_SerialNum[devidtmp][devchtmp]].modbus_address[1];
	  add3.add1[1]=MOD_Gas[SPARA.PO_SerialNum[devidtmp][devchtmp]].modbus_address[0];
          if(type=='c')
          {
            caltemp[2]  =add3.add1[1];
            caltemp[3]  =add3.add1[0];
          }
          else if(type=='s')
          {
            add3.add2+=1;
            caltemp[2]  =add3.add1[1];
            caltemp[3]  =add3.add1[0];
          }
          caltemp[4]  =0x00;
          caltemp[5]  =0x01;    //number of registers
          caltemp[6]  =0x02;    //two bytes
          caltemp[7]  =0xff;    //data high byte
          caltemp[8]  =0x00;        //data low byte

          CRC_Calculation(caltemp,9,CRC16);
          caltemp[9]=CRC16[0];		//CRC高
          caltemp[10]=CRC16[1];		//CRC低

          /*禁止中断*/
          _BIC_SR(GIE);
          if(caltemp[0]<=0x04)
                  SendData(caltemp,11,COM5); //485
          else if(caltemp[0]==0x05)
                  SendData(caltemp,11,COM2); //232
          else
                  SendData(caltemp,11,COM3); //232
          /*开中断*/
          _BIS_SR(GIE);
          return;
        }
      }

      else if(SPARA.PO_Type[devidtmp]==1)
      {
        if(strcmp(devcpoID,MOD_Water[SPARA.PO_SerialNum[devidtmp][devchtmp]].PO_code)==0)
        {
          caltemp[0]  =devidtmp+1;
          caltemp[1]  =0x10;
          add3.add1[1]  =MOD_Water[SPARA.PO_SerialNum[devidtmp][devchtmp]].modbus_address[0];
          add3.add1[0]  =MOD_Water[SPARA.PO_SerialNum[devidtmp][devchtmp]].modbus_address[1];
          if(type=='c')
          {
            caltemp[2]  =add3.add1[1];
            caltemp[3]  =add3.add1[0];
          }
          else if(type=='s')
          {
            add3.add2+=1;
            caltemp[2]  =add3.add1[1];
            caltemp[3]  =add3.add1[0];
          }
          caltemp[4]  =0x00;
          caltemp[5]  =0x01;    //number of registers
          caltemp[6]  =0x02;    //two bytes
          caltemp[7]  =0xff;    //data high byte
          caltemp[8]  =0x00;    //data low byte

          CRC_Calculation(caltemp,9,CRC16);
          caltemp[9]=CRC16[0];		//CRC高
          caltemp[10]=CRC16[1];		//CRC低

          /*禁止中断*/
          _BIC_SR(GIE);
          if(caltemp[0]<=0x04)
                  SendData(caltemp,11,COM5); //485
          else if(caltemp[0]==0x05)
                  SendData(caltemp,11,COM2); //232
          else
                  SendData(caltemp,11,COM3); //232
          /*开中断*/
          _BIS_SR(GIE);
          return;
        }
      }

    }
  }
}

void dev_operate(void)
{
  Symbol.Mod_checkover=1;
}

void dev_settimes(void)
{
  INT8U caltemp[60];
  INT16U devidtmp=0,devchtmp=0,i;
  INT8U CRC16[2];
  union
  {
          char add1[2];
          int add2;
  }add3;

  for(devidtmp=0;devidtmp<6;devidtmp++)
  {
    for(devchtmp=0;devchtmp<16;devchtmp++)
    {
      if(SPARA.PO_Type[devidtmp]==2)
      {
        if(strcmp(devcpoID,MOD_Gas[SPARA.PO_SerialNum[devidtmp][devchtmp]].PO_code)==0)
        {
          caltemp[0]  =devidtmp+1;
          caltemp[1]  =0x10;
          add3.add1[0]=MOD_Gas[SPARA.PO_SerialNum[devidtmp][devchtmp]].modbus_address[1];
	  add3.add1[1]=MOD_Gas[SPARA.PO_SerialNum[devidtmp][devchtmp]].modbus_address[0];

          add3.add2+=10;
          caltemp[2]  =add3.add1[1];
          caltemp[3]  =add3.add1[0];


          caltemp[4]  =(INT8U)(devctnum>>8);
          caltemp[5]  =(INT8U)devctnum;    //number of registers
          caltemp[6]  =(INT8U)(2*devctnum);    //bytes
          for(i=0;i<devctnum;i++)
          {
            caltemp[7+2*i]  =0x00;    //data high byte
            caltemp[8+2*i]  =devctime[i];        //data low byte
          }
          CRC_Calculation(caltemp,7+2*i,CRC16);
          caltemp[7+2*i]=CRC16[0];		//CRC高
          caltemp[8+2*i]=CRC16[1];		//CRC低

          /*禁止中断*/
          _BIC_SR(GIE);
          if(caltemp[0]<=0x04)
                  SendData(caltemp,9+2*i,COM5); //485
          else if(caltemp[0]==0x05)
                  SendData(caltemp,9+2*i,COM2); //232
          else
                  SendData(caltemp,9+2*i,COM3); //232
          /*开中断*/
          _BIS_SR(GIE);
          devctnum  =0;
          return;
        }
      }

      else if(SPARA.PO_Type[devidtmp]==1)
      {
        if(strcmp(devcpoID,MOD_Water[SPARA.PO_SerialNum[devidtmp][devchtmp]].PO_code)==0)
        {
          caltemp[0]  =devidtmp+1;
          caltemp[1]  =0x10;
          add3.add1[1]  =MOD_Water[SPARA.PO_SerialNum[devidtmp][devchtmp]].modbus_address[0];
          add3.add1[0]  =MOD_Water[SPARA.PO_SerialNum[devidtmp][devchtmp]].modbus_address[1];
          add3.add2+=10;
          caltemp[2]  =add3.add1[1];
          caltemp[3]  =add3.add1[0];


          caltemp[4]  =(INT8U)(devctnum>>8);
          caltemp[5]  =(INT8U)devctnum;    //number of registers
          caltemp[6]  =(INT8U)(2*devctnum);    //bytes
          for(i=0;i<devctnum;i++)
          {
            caltemp[7+2*i]  =0x00;    //data high byte
            caltemp[8+2*i]  =devctime[i];        //data low byte
          }
          CRC_Calculation(caltemp,7+2*i,CRC16);
          caltemp[7+2*i]=CRC16[0];		//CRC高
          caltemp[8+2*i]=CRC16[1];		//CRC低

          /*禁止中断*/
          _BIC_SR(GIE);
          if(caltemp[0]<=0x04)
                  SendData(caltemp,9+2*i,COM5); //485
          else if(caltemp[0]==0x05)
                  SendData(caltemp,9+2*i,COM2); //232
          else
                  SendData(caltemp,9+2*i,COM3); //232
          /*开中断*/
          _BIS_SR(GIE);
          devctnum  =0;
          return;
        }
      }

    }
  }
}

#pragma vector=WDT_VECTOR
__interrupt void WatchDog_ISR(void)
{
  WatchDogCNT++;
  if((WatchDogCNT%0xc8)==0)
	//if(Symbol.Mod_ontime)
	if((Symbol.Mod_symbol==0))
	{
		Symbol.Mod_Device_Check=1;
	}
}
